/* General */
"action-cancel" = "Cancel";

/* General */
"action-clean" = "Clean";

/* General */
"action-continue" = "Continue";

/* General */
"action-done" = "Done";

/* General */
"action-reset" = "Reset";

/* General */
"action-save" = "Save";

/* Open iCloud System Preferences */
"ALERT-SYSTEM-SETTING" = "System Preferences";

/* In Preference */
"CACHE-CLEAN-ALL-CONFIRM-MESSAGE" = "You cannot undo this action.";

/* In Preference */
"CACHE-CLEAN-ALL-CONFIRM-TITLE" = "Are you sure you want to clear all caches?";

/* Launch check */
"DB-RESET-SCHEMA-CONFIRM-MESSAGE" = "Reset will lose all local records, and there is no guarantee that the problem will be fixed.";

/* Launch check */
"DB-RESET-SCHEMA-CONFIRM-TITLE" = "Are you sure you want to reset database?";

/* Image Load Error */
"DETAIL-IMAGE-URL-NULL-ERROR" = "Image URL is null.";

/* Detail swipe reach end */
"DETAIL-REACH-END" = "No more";

/* Detail swipe reach the top */
"DETAIL-REACH-TOP" = "At the top";

/* In Preference */
"DOWNLOAD-CHOOSE-DIRECTORY-PANEL-BUTTON" = "Choose";

/* In Preference */
"DOWNLOAD-CHOOSE-DIRECTORY-PANEL-MESSAGE" = "Choose a directoriy to save";

/* In Preference */
"DOWNLOAD-DIRECTORY-NOT-SET" = "Path has not been specified.";

/* In HUD */
"FAVORITE-ADD" = "⭐️ Favorited";

/* In HUD */
"FAVORITE-REMOVE" = "💔 Unfavored";

/* iCloud No Account */
"iCloud-TURN-ON-MESSAGE" = "Send anonymous flag requires you to turn on iCloud for \(App().displayName).";

/* iCloud No Account */
"iCloud-TURN-ON-TITLE" = "Turn On iCloud";

/* Launch check */
"LaunchError-DBInitTitle" = "Database File is Abnormal";

/* Launch check */
"LaunchError-DBSchemaTitle" = "Database Initialization Failed";

/* Launch check */
"LaunchError-DBTooNewMessage" = "It seems that you have used a higher version of this app before, but downgrading is not supported. It is highly recommended to upgrade to the latest version.\n\nHowerver, if you choose continue, you may experience a crash or even data corruption, although it may work normally.";

/* Launch check */
"LaunchError-DBTooNewTitle" = "Downgraded Database File";

/* Link */
"link-guide" = "https://github.com/b9software/B9ImageBoard/discussions/1";

/* Link */
"link-privacy" = "https://github.com/b9software/B9ImageBoard/blob/main/PrivacyPolicy.md";

/* In Preference - Tag Blacklist */
"LIST-ACTION-REMOVE" = "Remove";

/* In HUD */
"POST-FLAG-SUCCESS" = "Thanks. I will look at it.";

/* In Server Edit */
"server-edit-base-exists" = "This Server already exists";

/* In Server Edit */
"server-edit-base-invalid-title" = "Invaild Server";

/* In Server Edit */
"server-edit-base-not-https" = "Only HTTPS server is supported.";

/* In Server Edit */
"server-edit-base-not-url" = "Input is not a URL.";

/* In Server List */
"server-list-empty" = "No server yet";

/* In Server List */
"servers-count-remind-message" = "Adding more than two servers will require payment in future versions.";

/* In Server List */
"servers-count-remind-title" = "Just a Reminder";

/* In Home */
"STREAM-NEW-POST" = "There are some new posts, click to view.";

/* String Dict */
"STRINGS-ImageCount" = "STRINGS-ImageCount";

/* String Dict */
"STRINGS-TagCount" = "STRINGS-TagCount";

/* In Preference - Tag Blacklist */
"TAG-BLACK-BUILDIN-NOTE" = "In order to make the content seen in the app safe for all ages, we have built-in filters. They are mandatory, you cannot edit or disable them.";

/* In Preference - Tag Blacklist */
"TAG-BLACK-BUILDIN-SECTION" = "Build In";

/* In Preference - Tag Blacklist */
"TAG-BLACK-CUSTOM-SECTION" = "Custom";

/* In Preference - Tag Blacklist */
"TAG-BLACK-DELETE-TIP" = "You can delete tags by swip left or select one then press delete";

/* In HUD */
"TAG-BLACK-EDIT-EXISTE" = "Tag existed";

/* In HUD */
"TAG-BLACK-EDIT-NAME-EMPTY" = "Tag name is empty";

/* In Preference - Tag Blacklist */
"tag-block-count-filter" = "Post Tag Count < 4";

/* In Editor Choice */
"tutorial-editor-demo" = "The posts here will not be updated regularly, they are for demonstration purposes. You should add some servers so that you can browse them in the stream.";

/* In Editor Choice */
"tutorial-editor-demo-china-notice" = "⚠️ NOTICE: You may have to use a proxy to load these posts in China mainland.";

/* In Editor Choice */
"tutorial-navigator" = "You can move to other views by clicking here.";

/* URLError */
"URLError-networkConnectionLost" = "Network connection may have been lost, please try again";

/* URLError */
"URLError-notConnectedToInternet" = "No internet connection, please check";

/* Error Display */
"URLError-status-404" = "This post may have been deleted.";

